package org.example.src.Task_5;

public class Task5 {
    public static String pluralizeRecords(int n) {
        if (n % 100 >= 11 && n %100 <= 14) {
            return "В результате выполнения запросы было найдено "  + n + " записей";
        }
        if (n % 10 == 1) {
            return "В результате выполнения запроса была найдена " + n + " запись";
        }
        if (n%10 >= 2 && n %10<=4) {
            return "В результате выполнения запроса было найдено " + n + " записи";
        }
        return "В результате выполнения запроса было найдено " + n + " записей";
    }
}
